test/request-response-samples/Dummy__should_work_with_tns_as_namespace/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.Dummy.com" xmlns:n="http://www.Dummy.com/Name/Types"><soap:Header></soap:Header><soap:Body><n:DummyRequest xmlns:n="http://www.Dummy.com/Name/Types" xmlns="http://www.Dummy.com/Name/Types"><n:DummyField1>Humpty</n:DummyField1><n:DummyFilter><c:DummyFilterString xmlns:c="http://www.Dummy.com/Common/Types">Dumpty</c:DummyFilterString></n:DummyFilter><n:DummyAccount><n:DummyName>Dummy</n:DummyName><n:DummyPassword>1234</n:DummyPassword></n:DummyAccount></n:DummyRequest></soap:Body></soap:Envelope>